let WidespreadSoftware = DeviceTvmSoftwareInventory
    | where OSPlatform == "Windows11"
    | summarize cnt_client = dcount(DeviceId) by SoftwareName, SoftwareVendor
    | where cnt_client > 100
    | project SoftwareName;
DeviceTvmSoftwareVulnerabilities
| where OSPlatform == ""
| where DeviceName contains ""
| where SoftwareName in (WidespreadSoftware)
| join kind=inner (DeviceTvmSoftwareInventory) on DeviceId, SoftwareName, SoftwareVersion
| join kind=inner (DeviceTvmSoftwareVulnerabilitiesKB) on CveId
| join kind=leftouter (DeviceTvmSoftwareEvidenceBeta) on SoftwareName, SoftwareVendor, SoftwareVersion, DeviceId
| extend VulAgeDays = datetime_diff('day', now(), PublishedDate)
| extend SLADays = case(
    VulnerabilitySeverityLevel == "Critical", 7,
    VulnerabilitySeverityLevel == "High", 30,
    VulnerabilitySeverityLevel == "Medium", 90,
    180) //low == 180 aka default
| extend DueDate = PublishedDate + totimespan(SLADays *1d)
| extend OverdueDays = datetime_diff('day', now(), DueDate)
| extend Status = iff(OverdueDays > 0, "Overdue", "In-Flight")
| where Status == "Overdue"
| project 
    DeviceId,
    DeviceName,
    OSPlatform,
    OSVersion,
    SoftwareVendor,
    SoftwareName,
    SoftwareVersion,
    CveId,
    //RegistryPaths,
    VulnerabilitySeverityLevel,
    VulAgeDays,
    DueDate,
    OverdueDays,
    Status
| distinct *
| order by DeviceName
