DeviceTvmSoftwareVulnerabilities
| where OSPlatform == "" //choose OS
| where DeviceName contains "" //filter for specific device groups if multi tenant org
| join kind=inner (DeviceTvmSoftwareInventory) on DeviceId, SoftwareName, SoftwareVersion
| join kind=inner (DeviceTvmSoftwareVulnerabilitiesKB) on CveId
| join kind=inner (DeviceTvmSoftwareEvidenceBeta) on SoftwareName, SoftwareVendor, SoftwareVersion, DeviceId
| extend VulAgeDays = datetime_diff('day', now(), PublishedDate)
| extend SLADays = case(
    VulnerabilitySeverityLevel == "Critical", 7,
    VulnerabilitySeverityLevel == "High", 30,
    VulnerabilitySeverityLevel == "Medium", 90,
    180) //low == 180 aka default
| extend DueDate = PublishedDate + totimespan(SLADays *1d)
| extend OverdueDays = datetime_diff('day', now(), DueDate)
| extend Status = iff(OverdueDays > 0, "Overdue", "In-Flight")
| project 
    DeviceId,
    DeviceName,
    OSPlatform,
    OSVersion,
    SoftwareVendor,
    SoftwareName,
    SoftwareVersion,
    CveId,
    tostring(RegistryPaths),
    VulnerabilitySeverityLevel,
    VulAgeDays,
    DueDate,
    OverdueDays,
    Status
| distinct *
| order by SoftwareName
